package data_structure

import "testing"

func TestMaxProfit(t *testing.T) {
	prices := []int{7, 1, 5, 3, 6, 4}
	t.Logf("最大利润为：%d", maxProfit(prices))
}

// maxProfit 买卖股票的最佳时机ii
// 给你一个整数数组 prices ，其中prices[i] 表示某支股票第 i 天的价格。
//
// 在每一天，你可以决定是否购买和/或出售股票。你在任何时候最多只能持有 一股 股票。你也可以先购买，然后在 同一天 出售。
//
// 返回 你能获得的 最大 利润。
//
// 示例 1：
//
// 输入：prices = [7,1,5,3,6,4]
// 输出：7
// 解释：在第 2 天（股票价格 = 1）的时候买入，在第 3 天（股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5 - 1 = 4 。
//
//	随后，在第 4 天（股票价格 = 3）的时候买入，在第 5 天（股票价格 = 6）的时候卖出, 这笔交易所能获得利润 = 6 - 3 = 3 。
//
// 总利润为 4 + 3 = 7 。
// 示例 2：
//
// 输入：prices = [1,2,3,4,5]
// 输出：4
// 解释：在第 1 天（股票价格 = 1）的时候买入，在第 5 天 （股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5 - 1 = 4 。
// 总利润为 4 。
// 示例：
//
// 输入：prices = [7,6,4,3,1]
// 输出：0
// 解释：在这种情况下, 交易无法获得正利润，所以不参与交易可以获得最大利润，最大利润为 0 。
func maxProfit(prices []int) int {
	length := len(prices)

	// 数组只有一个元素，那就不存在买入再卖出的情况，那么最大的利润就是不持有股
	if length < 2 {
		return 0
	}

	// 定义dp二维数组，一维表示第几天，二维表示在第几天时持有股和不持有股
	dp := make([][2]int, length)
	// 第一列表示不持有股的利润，第二列表示持有股的利润
	dp[0][0] = 0
	dp[0][1] = 0 - prices[0]

	for i := 1; i < length; i++ {
		// 第i天不持有股的利润 = max(第i-1天持有股的利润 + 第i天卖出的价格, 第i-1天不持有股的利润)
		dp[i][0] = max(dp[i-1][1]+prices[i], dp[i-1][0])
		// 第i天持有股的利润 = max(第i-1天持有股的利润, 第i-1天不持有股 - 第i天买入的价格)
		dp[i][1] = max(dp[i-1][1], dp[i-1][0]-prices[i])
	}
	return dp[length-1][0]
}

func max(m, n int) int {
	if m > n {
		return m
	}
	return n
}
